app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE (("messages"."to" = ? OR "messages"."to" = ?) AND "messages"."from" = ? OR ("messages"."to" = ? OR "messages"."to" = ?) AND "messages"."from" = ?)  [["to", 3], ["to", 1], ["from", 3], ["to", 3], ["to", 1], ["from", 1]]
---
  def index
    if params[:from].present? && params[:to].present? then
      @messages = Message.scope(params[:from], params[:to])
    else
      @messages = Message.all

INSERT INTO "messages" ("from", "to", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["from", 1], ["to", 2], ["text", "た"], ["created_at", 2017-04-25 02:22:18 UTC], ["updated_at", 2017-04-25 02:22:18 UTC]]
---
  def create
    @message = Message.new(from: params[:from], to: params[:to], text: params[:text])

    if @message.save