app/controllers/users_controller.rb

  def index
    if params[:id].present? then
      @users = User.where(id: params[:id])
    elsif params[:email].present? then
      @users = User.where(email: params[:email])
    else
      @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "\"tanaka@example.com\""]]
SELECT "users".* FROM "users"